Assignment2/convertKelvinToFahrenheit-request.xml

<?xml version="1.0"?>

<soap:Envelope
xmlns:soap="http://www.w3.org/2003/05/soap-envelope/"
soap:encodingStyle="http://www.w3.org/2003/05/soap-encoding">

<soap:Body xmlns:m="http://www.example.org/converter">
  <m:convertKelvinToFahrenheit>
    <m:Kelvin>298.75</m:Kelvin>
  </m:convertKelvinToFahrenheit>
</soap:Body>

</soap:Envelope>
